<template>
    <div class="bet_record">
        <div class="bet_body">
            <div class="bet_from">
                <div class="Soccer">西恩电竞--条款规则</div>
                <p>
                    1.我们网站上显示的电子竞技赛事的开赛日期及时间仅作参考，不保证一定准确。这意味着如果一场比赛提供的日期和/或时间不正确，投注仍然成立。
                    如果比赛暂停或延期，而且未在实际确定的开赛时间之后12小时内继续，那么这场比赛上的投注无效并予以退款。<br>
                    本规则的例外情况：不管比赛是否暂停或延期，有关一支战队/选手能否在锦标赛中晋级或夺冠的投注始终有效。<br>
                    如果比赛暂停或延期，而且未在实际确定的开赛时间之后12小时内继续，那么这场比赛上的投注无效并予以退款。<br>
                    本规则的例外情况：不管比赛是否暂停或延期，有关一支战队/选手能否在锦标赛中晋级或夺冠的投注始终有效。<br>
                </p>
                <p>
                    2.如果选手或战队的名字出现了拼写错误，只要可以认定投注对象是哪一局或哪一场，所有投注全部生效。如果选手或战队更改了名称，只要可以认定投注对象是哪一局或哪一场，使用之前名称提供的盘口全部生效。
                </p>
                <p>
                    3.如果正式比赛中选手使用错误的昵称或小号参加比赛，结果仍会有效，但该选手明显不是原应参加比赛选手的情形除外。
                </p>
                <p>
                    4.所有投注都使用相关竞赛主管部门公布的官方结果进行结算。
                </p>
                <p>
                    5.如果竞赛规则不允许出现平局，则加时赛（若有）也计算在内。
                </p>
                <div>
                    6.让分盘投注：根据具体比赛，电子竞技比赛的让分可采用回合/地图或其他计算方式。让分在本网站仅以“让分”表示。（例如，在反恐精英中是指获胜的回合数，而在星际争霸2中则指获胜的地图数。）<br>
                    让分的目的是让体育赛事双方更加对等，让博彩更加有趣。在电子竞技投注中，让分的方式是开局便让弱势方战队/选手获得若干地图/回合上的领先 <br>
                    如果选手A凭借两个或以上地图的优势赢得比赛，则投注选手A的玩家胜出，投注选手B的玩家落败。如果选手A只多赢了一张地图或选手B获胜，则投注选手B的玩家胜出，投注选手A的玩家落败。<br>
                   <p>例如：</p>
                    <table>
                        <thead>
                         <th></th>
                         <th>让分盘</th>
                         <th>赔率</th>
                        </thead>
                        <tbody>
                          <tr>
                              <td>选手A</td>
                              <td>-1.5</td>
                              <td>2.00</td>
                          </tr>
                          <tr>
                              <td>选手B</td>
                              <td>+1.5</td>
                              <td>1.85</td>
                          </tr>
                        </tbody>
                    </table>
                </div>
                <div>
                    <p>{{ text1 }}</p>
                    <table>
                        <thead>
                          <th colspan="3">星际争霸2三局两胜比赛示例：</th>
                        </thead>
                        <tbody>
                        <tr>
                            <td>大盘</td>
                            <td>2.5</td>
                            <td>1.93</td>
                        </tr>
                        <tr>
                            <td>小盘</td>
                            <td>2.5</td>
                            <td>1.93</td>
                        </tr>
                        </tbody>
                    </table>
                </div>
                <p>
                    8.若一方选手以2-0比分获胜，则所有小盘2.5投注为赢，大盘投注为输。若一方选手以2-1比分获胜，则所有大盘投注为赢，小盘投注为输。
                </p>
                <p>
                    9.如果因选手退赛或被取消参赛资格而导致地图没有完赛，有关比赛结果的所有投注将继续有效，根据官方公布的获胜选手决定胜负结果。此规则的例外情况是，在反恐精英中如果因战队退赛或被取消参赛资格而没有完成所有预定的地图回合，所有输赢盘、让分盘和总分盘投注都会被取消。
                </p>
                <p>
                    10.如果某选手/战队在赛事开始前退赛，或在赛中退赛，则有关该选手/战队夺冠或晋级的投注将被取消，并退还投注金。<br>
                    如果被列为“必须参赛”的相应选手/战队在赛事开始前退赛，则有关该选手/战队晋级或夺冠的投注无效，并退还投注金——此项规定适用于参赛的所有选手/战队。
                </p>
                <p>
                    11.如果之前公布的地图数/回合数发生改变或者地图/回合赛制不正确，那么让分盘和总分盘上的所有投注都会取消。有关输赢盘（比赛结果）的投注将继续有效。
                </p>
                <p>
                    12.在某张地图上开赛之前，如果选手或战队在这张地图上因对手退赛或管理方判定获胜，那么该地图上的所有投注都将被取消。<br>
                    在反恐精英：全球攻势中，如果一支战队在地图上所有计划回合开始前退赛、由管理方判定获胜或者失去资格，那么该地图上的所有投注都将被取消。<br>
                    在Dota2、英雄联盟等游戏中，如果某张地图比赛开始的前10分钟内发生了对手退赛或者管理方判定获胜的情况，那么该地图上的所有投注都将被取消。如果管理方判定获胜发生在第10分钟之后，那么该地图将使用官方结果进行派彩。<br>
                    如果系列赛中至少一张地图上的投注因上述任何原因而被取消，那么该系列赛盘口上的所有投注也都将被取消。此外，如果系列赛中至少一张地图的比赛被推迟了超过12个小时，那么该系列赛上的所有投注将被取消。
                    <br>
                </p>
                <p>
                    13.赛中盘体育博彩：在赛中盘博彩中，如果因平局、掉线或类似原因导致某一地图比赛重赛，那么有关这一地图的所有赛中盘投注都将被取消。重赛的地图比赛将视为另一局比赛。
                </p>
                <p>
                    14.投注不会因战队有替补或暂代队员参加比赛而取消。如果比赛的组织机构允许有替补队员且有官方公布的比赛结果，所有投注都将正常派彩。
                </p>
                <p>
                    15.在有英雄草案/冠军选择阶段的比赛（dota 2、英雄联盟等）中，允许在此阶段投注。
                </p>
                <div>
                   {{ text2 }} <br>
                   <p>
                       例子：Dota2的分钟数特别投注上提供的总分盘为36。<br>
                       如果地图在36:02结束，那么“大盘”上的投注将获胜，“小盘”上的投注将输掉。<br>
                       如果地图在35:45结束，那么“小盘”上的投注将获胜，“大盘”上的投注将输掉。<br>
                       如果地图正好在36:00结束，那么投注将算作平手，投注金额将被返还。<br>
                       第一座防御塔：第一个被毁掉一座防御塔的战队在该投注中落败。<br>
                       第一滴血：宣布在游戏中获得“第一滴血”的战队是该项投注中的胜出者。<br>
                       第一个获得10杀：在游戏中的计分板中首先得到10杀的战队是该项投注中的胜出者。<br>
                       第一回合：赢得第一回合的战队是该项投注中的胜出者。<br>
                       第一个赢得5个回合：第一个赢得5个回合的战队是该项投注中的胜出者。<br>
                       在Dota和英雄联盟中，任何击杀数特别投注都将使用游戏中的计分板派彩，计分板显示在屏幕的顶部。<br>
                   </p>
                </div>
                <p>
                    17.如果5v5队比赛开场时选手数低于10名，或6v6队比赛开场时选手数低于12名，将取消该地图和系列上的所有投注。
                    在DotA2和英雄联盟中，如果有选手在最初10分钟断线并无法重新连接，或在剩下的比赛中被替换，
                    取消该地图和系列上的所有投注。在反恐精英：全球攻势中，如果至少有5个回合由不到10名选手完成，<br>
                    将取消该地图和系列上的所有投注。一个或多个选手在进入DotA2或英雄联盟比赛10分钟后断线或退出，
                    不构成取消在该地图上的投注或与该地图相关的任何特别投注的有效理由。
                </p>
                <p>18.如果某张地图在比赛部分完成后重制或者时间倒流（比如英雄联盟中的时间断裂），任何已确定的特别投注（第一滴血、第一座防御塔、第一个10杀等）将按部分完成的地图中的比赛结果进行派彩。任何尚未确定的特别投注将以重制或者时间倒流的地图中的比赛结果进行派彩。</p>
                <p>
                    19.针对反恐精英：全球攻势赛中盘：当投注在标有“全枪全弹”的盘口时，比如Natus Vincere（第4回合，全枪全弹）对Virtus Pro（第4回合，全枪全弹），您的投注对象是谁将赢得此回合。为了让设在本回合上的投注成立，“全枪全弹”是一个必须满足的条件。<br>
                    例如，当投注在Natus Vincere（第4回合，全枪全弹）对Virtus Pro（第4回合，全枪全弹）上时，您投注的对象是哪支战队将赢得第四回合。然而，如果两支战队中一支未能达成“全枪全弹”，该回合的所有投注将取消。<br>
                    “全枪全弹”的定义如下：<br>
                    每支战队最多只有一名选手以一把价值不到$1000的主要武器开局。武器不一定为选手本人购买，也可以是由一名队友给予。<br>
                    例子： NaVi对Virtus Pro：<br>
                    NaVi属于T方，4名选手买入一把AK47，一名选手没有足够的钱，只买入一把Tec-9。Virtus Pro的所有选手都用步枪开局。因为只有一名选手以一把价值不到$1000的主要武器开局， 所以投注仍成立。<br>
                    NaVi对Virtus Pro： <br>
                    NaVi属于T方，4名选手买入一把AK47，一名选手只买入一把沙漠之鹰。Virtus Pro有四名选手以M4A1开局，一名选手以一支Five-Seven手枪开局。因为两队中各只有一名选手以一把价值不到$1000的主要武器开局， 所以投注仍成立。<br>
                    NaVi对Virtus Pro：<br>
                    NaVi属于T方，3名选手以一把AK47开局，2名选手只买入一把Tec-9。无论Virtus Pro队的选手购买什么，因同一队中有两名或更多选手以价值不到$1000的主要武器开局，本回合的所有投注都将被取消。<br>
                <p>
                  20.在一场比赛中，当一支战队/选手有一张或者一张以上的地图优势时，我们提供的“地图 1”始终指游戏中实际使用的第一张地图，“地图 2”指游戏中实际使用的第二张地图，以此类推。该规则与获取优势的原因无关。
                </p>
                <p>
                    21.在绝地求生、堡垒之夜和其他大逃杀游戏中，优胜冠军赢家将根据官方排名进行派彩。选手/战队之间的一对一比赛将根据哪位选手/哪支战队的官方排名更高来派彩。
                </p>
                <p>
                    22.如果我们在特定地图上提供特定选手的特别投注，那么该选手必须在那张地图上开始比赛，投注才能成立。如果我们在整场比赛中提供特定选手的特别投注，那么该选手必须在那场比赛的所有地图上开始比赛，投注才能成立。<br>
                    例子：<br>
                    Natus Vincere对FaZe——地图1——s1mple的总击杀数：大小盘21.5。如果s1mple在地图1上被另一名选手替换，那么该特别投注盘口上的所有投注都将被取消。<br>
                </p>
                <p>
                   <b>混合过关</b><br>
                    我能承受多大的风险？：<br>
                    1.连赢风险限额以连赢投注中盘口的风险金额为基准。<br>
                    因此，每次连赢投注按照每一局的限额进行计算，并且可能随所选的每次连赢投注而改变。<br>
                    限制：<br>
                    1.当适用时，西恩电竞cngame.asia 在其他赛事中保留限制混合过关的权力。<br>
                    2.一个日历日内，混合过关盘的 最大累积彩金为250,000美元。<br>
                    3.一次混合过关盘中，您最多可以选择 10 局。<br>
                    4.一次混合过关盘中，您最多可以选择 10 局比赛。有关特殊情况,请查询具体公告。<br>
                    例外情形: <br>
                    1.在同场的棒球比赛中，不接受连赢(过关)注码。<br>
                    2.西恩电竞cngame.asia 有权不提供其它赛事的 连赢(过关) 盘。<br>
                    3.在每一日历天内， 每位客户过关注码的派彩总和限为美金25万元 <br>
                    过关投注/累加器: <br>
                    在计算过关投注的彩金时，西恩电竞cngame.asia应用 精准的计算方法。 <br>
                    同场赛事内的连赢(过关)注码: <br>
                    西恩电竞cngame.asia通常允许对美式足球比赛进行过关投注。然而，由于相关性，我们可能会限制或不允许对特定比赛/半场比赛进行过关投注。 <br>
                    请注意如果发现这种投注被滥用，西恩电竞cngame.asia保留取消过关投注的权利。对上半场和下半场的过关投注也是如此。 <br>
                    连赢注码中出现某队打和, 取消或 "取消下注" 的情况: <br>
                    1.在一个过关/连赢的注单里，如果其中一个或者多个的选项出现走注（不输不赢）、比赛取消、或者无效的情形时，则该过关注单所含的关数将被依据剩余的有效选项而减少，重新计算派彩。
                    <br>
                    2.在一个过两关的注单里，如果其中有一关出现走注（不输不赢）、比赛取消或者无效时，则该过关注单将会被视为一笔单注，输赢计算时取其剩余的选项，采用原本的投注风险金去计算派彩。
                    <br>
                    3.在一个过关/连赢的注单里，发生有一个或多个选项的比赛延迟，则处理该过关/连赢投注时，将跟 随西恩电竞cngaming.asia 对于有关具体体育种类所列出的规定进行。例如：如果根据公司在这种体育里的规定，一笔单注将会被视作无效，则在过关投注中该相应的选项也将以无效处理。
                    <br>
                </p>
            </div>
        </div>
    </div>
</template>

<script>
    // import { mapActions } from 'vuex'
  // import Mixin from '@/utils/Mixin'

 export default {
    name: "rulesTerms",
    // mixins: [Mixin],
    data () {
        return {
            text1: '7.总分盘投注：电子竞技比赛的总分盘可采用回合/地图或是比赛采用的其他计分方式。总分仅以“总分”表示。',
            text2: ' 16.特别投注： 分钟数：在地图比赛时间上提供的总分盘（以分钟计）。如果地图比赛时间短于提供的总分盘，那么“小盘”上的投注将获胜，“大盘”上的投注将输掉。如果地图比赛时间长于提供的总分盘，那么“大盘”上的投注将获胜，“小盘”上的投注将输掉。如果地图比赛时间的分钟数和提供的总分盘相同，那么投注将算作平手，投注金额将被返还。 '
        }
    },
    created () {
    },
    mounted () {
    },
    methods: {}
    }
</script>

<style scoped lang="scss">
    .bet_record {
        background: #0b1422;
        height: 100%;
        width: 100%;
        position: relative;
        overflow: hidden;
    }
    .bet_body {
        position: absolute;
        left: 0;
        bottom: 0;
        right: 0;
        overflow: auto;
        clear: both;
        top: 81px;
        padding: 10px;
        .bet_from {
            padding: 10px;
            background: linear-gradient(to bottom,#fff 0,#f6f6f6 47%,#ededed 100%);
            width: 100%;
            box-shadow: 0 0 10px #000;
            z-index: 2;
        }
    }
    .Soccer {
        color: #fff;
        text-align: center;
        font-size: 16px;
        font-weight: bold;
        padding: 10px 0;
        position: relative;
        background-color: #0b1422;
    }
    p ,div{
        padding: 8px;
        font-size: 14px;
        table {
            width: 50%;
            text-align: center;
            td,th{
                border:1px solid #999;
                padding: 5px;
            }
        }
        b {
            color: #e4393c;
            font-size: 15px;
            font-weight: bold;
        }
    }
</style>